Repository: yanajurina/tms01
Catalog: DZlesson15/DZlesson15/*.lproj/Localizable.strings
Languages: ru

# go_button_text
source: GO!
ru: К игре!

# results_button_text
source: Results
ru: Результаты

# settings_button_text
source: Settings
ru: Настройки

# back_button_text
source: back
ru: назад

source: Choose checkers style
ru: Выбери стиль для шашек

# choose_the_background
source: Сhoose the background
ru: Выбери фон игры

source: About the game
ru: Узнать о игре

# titleLabel_style_vc
source: Сhoose checkers style!
ru: Выбери стиль шашек

# selectButtonLabel_text_xib
source: Select
ru: Выбрать

# history_label_text
source: History
ru: История игры

# text_history_label_text
source: The English name of the game «Checkers» comes from checkered, which means «cellular». This is not surprising, because in the game of checkers, perhaps the most important attribute is a board, divided into cells. And the history of the origin of such a checkered board goes back to Ancient Egypt with its game Alkerk in the 1600s BC. Modern checkers were invented by the French, around the middle of the nineteenth century, who crossed the ancient Greek Alkerk with the game of chess. Checkers began to walk like a Queen in chess. In England, the game is still called - draughts - the queen's move in chess. The first World Drafts Championship was held in 1847. The winner was Andrew Anderson from Scotland. Since most of the games in the world championships ended in a draw, in 1890 the two-way prohibition rule was introduced - the first two moves were chosen absolutely randomly. In 1934, the rule was transformed into a three-way prohibition, when three moves were already chosen at random, but from the allowed list of combinations.
ru: Английское название игры «Шашки» происходит от слова «клетчатый», что означает сотовый. Это неудивительно, ведь в игре в шашки, пожалуй, самый важный атрибут - это доска, разделенная на клетки. И история происхождения такой клетчатой ​​доски уходит корнями в Древний Египет, где была игра Алкерк в 1600-х годах до нашей эры. Современные шашки были изобретены французами примерно в середине девятнадцатого века, которые скрестили древнегреческий Алкерк с игрой в шахматы. Шашки стали ходить, как королева в шахматах. В Англии эту игру до сих пор называют шашками - ход ферзя в шахматах. Первый чемпионат мира по шашкам прошел в 1847 году. Победителем стал Эндрю Андерсон из Шотландии. Поскольку большинство партий на чемпионатах мира заканчивались вничью, в 1890 году было введено правило запрета двусторонней игры - первые два хода выбирались совершенно случайно. В 1934 году правило было преобразовано в трехсторонний запрет, когда три хода уже выбирались наугад, но из разрешенного списка комбинаций.

# good_luck_label_text
source: Good Luck!
ru: Удачи!

# play_button_text
source: Play
ru: К игре!

# title_label_text
source: Enter your names, please
ru: Введите ваши имена, пожалуйста

# button_stop_text
source: Stop
ru: Стоп
